PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p18f47j13.inc
;----- PD0 Bits -----------------------------------------------------
ADCMD            EQU  H'0000'
SPI1MD           EQU  H'0001'
SPI2MD           EQU  H'0002'
UART1MD          EQU  H'0003'
UART2MD          EQU  H'0004'
ECCP1MD          EQU  H'0005'
ECCP2MD          EQU  H'0006'
ECCP3MD          EQU  H'0007'

PMDMSSP1         EQU  H'0001'
PMDMSSP2         EQU  H'0002'
PMDUART1         EQU  H'0003'
PMDUART2         EQU  H'0004'
PMDECCP1         EQU  H'0005'
PMDECCP2         EQU  H'0006'
PMDECCP3         EQU  H'0007'

PMDADC           EQU  H'0000'



;----- PMDIS0 Bits -----------------------------------------------------
ADCMD            EQU  H'0000'
SPI1MD           EQU  H'0001'
SPI2MD           EQU  H'0002'
UART1MD          EQU  H'0003'
UART2MD          EQU  H'0004'
ECCP1MD          EQU  H'0005'
ECCP2MD          EQU  H'0006'
ECCP3MD          EQU  H'0007'

PMDMSSP1         EQU  H'0001'
PMDMSSP2         EQU  H'0002'
PMDUART1         EQU  H'0003'
PMDUART2         EQU  H'0004'
PMDECCP1         EQU  H'0005'
PMDECCP2         EQU  H'0006'
PMDECCP3         EQU  H'0007'

PMDADC           EQU  H'0000'



;----- PD1 Bits -----------------------------------------------------
TMR1MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR3MD           EQU  H'0003'
TMR4MD           EQU  H'0004'
RTCCMD           EQU  H'0005'
CTMUMD           EQU  H'0006'
PSPMD            EQU  H'0007'

PMDTMR1          EQU  H'0001'
PMDTMR2          EQU  H'0002'
PMDTMR3          EQU  H'0003'
PMDTMR4          EQU  H'0004'

PMDRTCC          EQU  H'0005'
PMDCTMU          EQU  H'0006'
PMDPSP           EQU  H'0007'



;----- PMDIS1 Bits -----------------------------------------------------
TMR1MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR3MD           EQU  H'0003'
TMR4MD           EQU  H'0004'
RTCCMD           EQU  H'0005'
CTMUMD           EQU  H'0006'
PSPMD            EQU  H'0007'

PMDTMR1          EQU  H'0001'
PMDTMR2          EQU  H'0002'
PMDTMR3          EQU  H'0003'
PMDTMR4          EQU  H'0004'

PMDRTCC          EQU  H'0005'
PMDCTMU          EQU  H'0006'
PMDPSP           EQU  H'0007'



;----- PD2 Bits -----------------------------------------------------
CMP1MD           EQU  H'0000'
CMP2MD           EQU  H'0001'
CMP3MD           EQU  H'0002'
TMR5MD           EQU  H'0003'
TMR6MD           EQU  H'0004'
TMR8MD           EQU  H'0006'

PMDCMP1          EQU  H'0000'
PMDCMP2          EQU  H'0001'
PMDCMP3          EQU  H'0002'

PMDTMR5          EQU  H'0003'
PMDTMR6          EQU  H'0004'
PMDTMR8          EQU  H'0006'



;----- PMDIS2 Bits -----------------------------------------------------
CMP1MD           EQU  H'0000'
CMP2MD           EQU  H'0001'
CMP3MD           EQU  H'0002'
TMR5MD           EQU  H'0003'
TMR6MD           EQU  H'0004'
TMR8MD           EQU  H'0006'

PMDCMP1          EQU  H'0000'
PMDCMP2          EQU  H'0001'
PMDCMP3          EQU  H'0002'

PMDTMR5          EQU  H'0003'
PMDTMR6          EQU  H'0004'
PMDTMR8          EQU  H'0006'



;----- PD3 Bits -----------------------------------------------------
CCP4MD           EQU  H'0001'
CCP5MD           EQU  H'0002'
CCP6MD           EQU  H'0003'
CCP7MD           EQU  H'0004'
CCP8MD           EQU  H'0005'
CCP9MD           EQU  H'0006'
CCP10MD          EQU  H'0007'

PMDCCP4          EQU  H'0001'
PMDCCP5          EQU  H'0002'
PMDCCP6          EQU  H'0003'
PMDCCP7          EQU  H'0004'
PMDCCP8          EQU  H'0005'
PMDCCP9          EQU  H'0006'
PMDCCP10         EQU  H'0007'




;----- PMDIS3 Bits -----------------------------------------------------
CCP4MD           EQU  H'0001'
CCP5MD           EQU  H'0002'
CCP6MD           EQU  H'0003'
CCP7MD           EQU  H'0004'
CCP8MD           EQU  H'0005'
CCP9MD           EQU  H'0006'
CCP10MD          EQU  H'0007'

PMDCCP4          EQU  H'0001'
PMDCCP5          EQU  H'0002'
PMDCCP6          EQU  H'0003'
PMDCCP7          EQU  H'0004'
PMDCCP8          EQU  H'0005'
PMDCCP9          EQU  H'0006'
PMDCCP10         EQU  H'0007'




;----- PPSCON Bits -----------------------------------------------------
IOLOCK           EQU  H'0000'


;----- CCP10CON Bits -----------------------------------------------------
CCP10M0          EQU  H'0000'
CCP10M1          EQU  H'0001'
CCP10M2          EQU  H'0002'
CCP10M3          EQU  H'0003'
DC10B0           EQU  H'0004'
DC10B1           EQU  H'0005'


;----- CCP9CON Bits -----------------------------------------------------
CCP9M0           EQU  H'0000'
CCP9M1           EQU  H'0001'
CCP9M2           EQU  H'0002'
CCP9M3           EQU  H'0003'
DC9B0            EQU  H'0004'
DC9B1            EQU  H'0005'


;----- CCP8CON Bits -----------------------------------------------------
CCP8M0           EQU  H'0000'
CCP8M1           EQU  H'0001'
CCP8M2           EQU  H'0002'
CCP8M3           EQU  H'0003'
DC8B0            EQU  H'0004'
DC8B1            EQU  H'0005'


;----- CCP7CON Bits -----------------------------------------------------
CCP7M0           EQU  H'0000'
CCP7M1           EQU  H'0001'
CCP7M2           EQU  H'0002'
CCP7M3           EQU  H'0003'
DC7B0            EQU  H'0004'
DC7B1            EQU  H'0005'


;----- CCP6CON Bits -----------------------------------------------------
CCP6M0           EQU  H'0000'
CCP6M1           EQU  H'0001'
CCP6M2           EQU  H'0002'
CCP6M3           EQU  H'0003'
DC6B0            EQU  H'0004'
DC6B1            EQU  H'0005'


;----- CCP5CON Bits -----------------------------------------------------
CCP5M0           EQU  H'0000'
CCP5M1           EQU  H'0001'
CCP5M2           EQU  H'0002'
CCP5M3           EQU  H'0003'
DC5B0            EQU  H'0004'
DC5B1            EQU  H'0005'


;----- CCP4CON Bits -----------------------------------------------------
CCP4M0           EQU  H'0000'
CCP4M1           EQU  H'0001'
CCP4M2           EQU  H'0002'
CCP4M3           EQU  H'0003'
DC4B0            EQU  H'0004'
DC4B1            EQU  H'0005'


;----- CCP3CON Bits -----------------------------------------------------
CCP3M0           EQU  H'0000'
CCP3M1           EQU  H'0001'
CCP3M2           EQU  H'0002'
CCP3M3           EQU  H'0003'
DC3B0            EQU  H'0004'
DC3B1            EQU  H'0005'
P3M0             EQU  H'0006'
P3M1             EQU  H'0007'


